#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//（有符号）整形在内存中的存储
//原码 反码 补码均分成两部分：符号位和数值位
//原码：直接翻译成二进制
//例如  int a=10   00000000000000000000000000001010
//int b=-10   10000000000000000000000000001010

//反码：符号位不变，将原码的其他位按位取反
//例如  int b=-10   11111111111111111111111111110101

//补码：反码+1
//例如  int b=-10   11111111111111111111111111110110

//正数三码相同
//负数原反补才要按规则算

//int check_sys()
//{
//	int a = 1;
//	char*p = (char*)&a;
//	if (*p == 1)
//		return 1;//小端
//	else
//		return 0;//大端
//}
//简化
//int check_sys()
//{
//	int a = 1;
//	return (*(char*)&a);
//}
//int main()
//{
//	if (check_sys() == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0; 
//}

//练习
//int main()
//{
//	//例一
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110  反码
//	//11111111111111111111111111111111  补码
//	//1111111  -a 截断
//	//整型提升 %d 打印的时候
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001
//	//-1
//	signed char b = -1;
//	//与a同理
//	unsigned char c = -1;
//	//11111111
//	//整型提升（看符号位 无符号提0）
//	//00000000000000000000000011111111
//	printf("a=%d,b=%d,c=%d\n", a, b, c);
//	





	//例二
	/* char a = -128;*/
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000
	//10000000 -a
	//整型提升 a是有符号，提1  无符号位提0   
	//11111111111111111111111110000000
	//而无符号整数三码相同 ，结果就是上面这个
	//转换成十进制4294967168
	/*printf("a=%u\n", a);*/
	//%u打印十进制 ，无符号整数





//	//例三
//	char a = 128;
//	//00000000000000000000000010000000
//	//10000000 - a
//	//整形提升
//	//11111111111111111111111110000000
//	//结果和上面那题一样
//	printf("a=%u\n", a);



//}

//例题四
//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100

//	unsigned int j = 10;
//	//00000000000000000000000000001010
//	//11111111111111111111111111101100
//  //相加
//	//11111111111111111111111111110110
//
//	//11111111111111111111111111110110补码
//	//11111111111111111111111111110101反码
//	//10000000000000000000000000001010原码
//结果为-10                                                     
//	printf("%d\n", i + j);
//
//	return 0;
//}

//例五
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;   //从-1 到 -128  然后从127 到 0
//	}
//	printf("%d", strlen(a));//结果为255
//}

//例六
//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hhhhh"); //死循环
//	}
//	return 0;
//}

//例七
//unsigned int i = 0;
//int main()
//{
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n",i); //死循环
//	}
//	return 0;
//}


//浮点型在内存中的存储

int main()
{
	int n = 9;
	float* pFloat = (float*)&n;
	printf("%d\n", n);
	printf("%f\n", *pFloat);
	
	*pFloat = 9.0;
	printf("%d\n", n);
	printf("%f\n", *pFloat);
	//这题要深入理解浮点数在内存中存储
}